// واحدِ مرجع برای تایپ و دیتا

export type CommitteeMember = {
  id: number;
  name: string;
  role: string;
  affiliation: string;
  photo?: string;
  shortBio?: string;
  profileUrl?: string;
  tags?: string[]; // اختیاری
};

// نمونه دیتا (می‌تونی با دیتای واقعی خودت جایگزین/تکمیل کنی)
export const COMMITTEE: CommitteeMember[] = [
  {
    id: 1,
    name: "دکتر رسول کریمی",
    role: "دبیر علمی رویداد",
    affiliation: "دانشکده مهندسی مکانیک",
    photo: "/images/committee/Dr_Karimi.png",
    shortBio: "دکترای مهندسی مکانیک با تخصص در طراحی مکانیکی، بهینه‌سازی انرژی و توسعه سیستم‌های صنعتی تاب‌آور. پژوهشگر و استاد دانشگاه با تمرکز بر راهکارهای نوآورانه مهندسی برای افزایش کارآمدی و مدیریت بحران.",
    profileUrl: "#",
    tags: ["دبیر علمی", "مهندسی مکانیک", "نوآوری صنعتی", "تاب‌آوری"]
  },
  {
    id: 2,
    name: "ناخدا یکم کمیسر رسول قادری",
    role: "دبیر اجرایی رویداد",
    affiliation: "فرمانده پشتیبانی دانشگاه علوم دریایی امام خمینی (ره)",
    photo: "/images/committee/Dr_Qaderi.png",
    shortBio: "دبیر اجرایی رویداد با تجربه مدیریتی و سازمانی در حوزه پشتیبانی و هماهنگی. مسئولیت هدایت و پشتیبانی عملیاتی دانشگاه علوم دریایی امام خمینی (ره) را بر عهده دارد و نقش کلیدی در برگزاری و مدیریت اجرایی رویداد ایفا می‌کند.",
    profileUrl: "#",
    tags: ["دبیر اجرایی", "مدیریت", "پشتیبانی", "هماهنگی"]

  },
  
];
